# HermiteSplineTangents Class

---
This class indicates tangency at the start, the end, or both ends of the curve.
SystemObject Autodesk.Revit.DBHermiteSplineTangents
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class HermiteSplineTangents : IDisposable

    Public Class HermiteSplineTangents
    	Implements IDisposable

    public ref class HermiteSplineTangents : IDisposable

    type HermiteSplineTangents =
        class
            interface IDisposable
        end
The HermiteSplineTangents type exposes the following members.
| Name| Description
---|---|---
| HermiteSplineTangents|  Constructs a new default instance of the class, with tangent vectors uninitialized.
Top
| Name| Description
---|---|---
| EndTangent|  The tangent vector at the end of the curve.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| StartTangent|  The tangent vector at the start of the curve.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the HermiteSplineTangents
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
Initially, the tangent vectors will not be set, and no tangency condition will be imposed when the curve is created.
#### Reference
Autodesk.Revit.DB Namespace